kcaluwae/dspic33e-bootloader/dspic_bootloader/bootloader.c
/*
 * CAN(CANopen) and UART bootloader for the dsPIC33E.
 *
 * The UART section of this file is loosely based on the AN1094 application
 * note from Microchip, which is available at:
 * http://www.microchip.com/stellent/idcplg?IdcService=SS_GET_PAGE&nodeId=1824&appnote=en530200
 *
 * The CAN implementation is not fully CANopen compliant, but is expected to
 * be compatible with most CANopen implementations (tested using CANfestival).
 *
 * Ken Caluwaerts 2014 <ken@caluwaerts.eu>
 *
 * Copyright © 2014, Ken Caluwaerts
 * All rights reserved.
 *
 * The CAN(CANopen) and UART bootloader for the dsPIC33E bootloader is licensed
 * under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * http://www.apache.org/licenses/LICENSE-2.0.
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific language
 * governing permissions and limitations under the License.
 *
 */
#include <stdint.h>
#include "p33Exxxx.h"
#include "bootloader.h"
#include "canbus.h"

_FOSCSEL(FNOSC_FRCPLL & IESO_OFF & PWMLOCK_OFF);
/*PWMLOCK_OFF needed to configure PWM*/
_FOSC(FCKSM_CSECMD & OSCIOFNC_OFF & POSCMD_NONE);
_FWDT(FWDTEN_OFF);
/* Disable JTAG */
_FICD(JTAGEN_OFF); /* & ICS_PGD2);*/
_FGS(GCP_OFF); /* Disable Code Protection */

/*defined in memory.s*/
extern uint32_t read_latch(uint16_t, uint16_t);
extern void reset_device();

/*This buffer is used to write/read program memory internally*/
char buffer[PM_ROW_SIZE * 3 + 1];

#ifndef BL_UART
/*This buffer is used by the CAN code to temporary store program memory*/
uint8_t can_prog_data[PM_ROW_SIZE*3+4];
#endif

int main(void)
 {
    ureg32_t source_addr;
    ureg32_t delay;
    /*
     * 70 MIPS:
     * FOSC = Fin*(PLLDIV+2)/((PLLPRE+2)*2(PLLPOST+1))
     * FOSC = 7.37MHz(74+2)/((0+2)*2(0+1)) = 140.03Mhz
     * Fcy = FOSC/2
     */
    PLLFBD = 74;
    CLKDIVbits.PLLPRE = 0;
    CLKDIVbits.PLLPOST = 0;
    while (OSCCONbits.LOCK != 1);
    RCONbits.SWDTEN = 0; /* Disable Watch Dog Timer*/

    source_addr.val32 = 0x1000;

    delay.val32 = BOOT_DELAY; //ReadLatch(SourceAddr.Word.HW, SourceAddr.Word.LW);

    if (delay.val[0] == 0) {
        reset_device();
    }

    T2CONbits.T32 = 1; /* increments every instruction cycle */
    IFS0bits.T3IF = 0; /* Clear the Timer3 Interrupt Flag */
    IEC0bits.T3IE = 0; /* Disable Timer3 Interrup Service Routine */

    if ((delay.val32 & 0x000000FF) != 0xFF) {
        /* Convert seconds into timer count value */
        delay.val32 = ((uint32_t) (FCY)) * ((uint32_t) (delay.val[0]));
        PR3 = delay.word.HW;
        PR2 = delay.word.LW;
        TMR3HLD = 0x0000;
        TMR2 = 0x0000;
        T2CONbits.TON = 1;
    }

    /*Configure pins*/
    /*Set all pins to input*/
    TRISA = 0xFFFF;
    TRISB = 0xFFFF;

    /*Configure all analog ports as digital I/O*/
    ANSELA = 0x0;
    ANSELB = 0x0;

#ifdef BL_UART
    /* Serial version of the bootloader */
    char command;

    TRISBbits.TRISB4 = 0; //RP36 is output (UART2TX)
    RPINR19bits.U2RXR = 47; //pin 26==RPI47 is RX input
    _RP36R = 0b11; //U2TX to RP36 (pin 11)

    U2BRG = BRGVAL; /*  BAUD Rate Setting of Uart2  */
    U2MODE = 0x8000; /* Reset UART to 8-n-1, alt pins, and enable */
    U2MODEbits.BRGH = 0;
    U2STA = 0x0400; /* Reset status register and enable TX */

    while (1) {
        get_char(&command);
        switch (command) {
            case COMMAND_WRITE_PM: /* tested */
            {
                int size;
                /*Get the page address*/
                get_char(&(source_addr.val[0]));
                get_char(&(source_addr.val[1]));
                get_char(&(source_addr.val[2]));
                source_addr.val[3] = 0;

                /*Get the page contents*/
                for (size = 0; size < PM_ROW_SIZE * 3; size++) {
                    get_char(&(buffer[size]));
                }

                /*Erase the page*/
                erase_33E(source_addr.word.HW, source_addr.word.LW);
                write_PM(buffer, source_addr); /*program page */

                put_char(COMMAND_ACK); /*Send Acknowledgement */
                break;
            }
            case COMMAND_READ_ID:
            {
                ureg32_t temp;

                source_addr.val32 = 0xFF0000;
                temp.val32 = read_latch(source_addr.word.HW, source_addr.word.LW);
                write_buffer(&(temp.val[0]), 4);
                source_addr.val32 = 0xFF0002;
                temp.val32 = read_latch(source_addr.word.HW, source_addr.word.LW);
                write_buffer(&(temp.val[0]), 4);

                break;
            }	
            case COMMAND_RESET:
            case COMMAND_NACK:
            {
                reset_device();
                break;
            }
            default:
                put_char(COMMAND_NACK);
                break;
        }

    }
#endif
/*Don't replace this with #else (ifndefs can be toggled in MPLAB X) */
#ifndef BL_UART
    /* CAN version of the bootloader*/
    can_init();
    can_states state = CAN_STATE_BOOTUP;
    uint8_t can_msg_received = 0;
    uint8_t can_msg_transmitted = 0;
    Message can_msg_rec;
    uint8_t can_exp_buffer[4]; /*Expedited data buffer*/
    ureg32_t temp;
    uint8_t sdo_ccs, sdo_n, sdo_e, sdo_s;
    uint16_t sdo_OD_idx;
    uint8_t sdo_OD_sidx;
    uint16_t can_heartbeat_time = 100; /*Heartbeat producer period in ms*/
    unsigned can_disable_boot_timeout = 0;
    ureg32_t delay_hb;
    unsigned can_receiving_prog_data = 0; /*is program data upload in progress?*/
    uint16_t can_prog_data_ctr = 0; /*number of data bytes received for data upload*/
    uint8_t can_toggle = 0;
    uint8_t can_toggle_received;
    uint8_t can_last_segment;
    uint8_t can_segment_n;
    uint8_t can_segment_num_bytes;
    uint16_t can_num_segments_ctr;
    uint16_t i;

    can_msg_rec.cob_id = 0;
    can_msg_rec.len = 0;
    can_msg_rec.rtr = 0;
    
    /*Set up a timer with a 1ms period*/
    T4CONbits.T32 = 1; /* to increment every instruction cycle */
    IFS1bits.T5IF = 0; /* Clear the Timer5 Interrupt Flag */
    IEC1bits.T5IE = 0; /* Disable Timer5 Interrup Service Routine */

