kcaluwae/dspic33e-bootloader/dspic_bootloader/bootloader.c
    /* Convert seconds into timer count value */
    delay_hb.val32 = (((uint32_t) (FCY)) / ((uint32_t) 1000)) * ((uint32_t) (can_heartbeat_time));
    PR5 = delay_hb.word.HW;
    PR4 = delay_hb.word.LW;
    TMR5HLD = 0x0000;
    TMR4 = 0x0000;
    /* Enable Timer */
    if(can_heartbeat_time>0){
        T4CONbits.TON = 1;
    } else{
        T4CONbits.TON = 0;
    }

    while(1){
        if(!can_disable_boot_timeout && IFS0bits.T3IF){
            /*Bootloader timeout*/
            can_send_heartbeat(4);
            reset_device();
        }

        /*Receive a CAN message*/
        can_msg_received = can_receive_msg(&can_msg_rec);
        /* Clear transmitted interrupt flag */
        if (C1INTFbits.TBIF) {
            C1INTFbits.TBIF = 0; //message was transmitted, nothing to do
            can_msg_transmitted = 1; //can be used by the state machine
        }
        IFS2bits.C1IF = 0; //clear CAN interrupt flag
        
        /*State machine*/
        switch(state){
            case CAN_STATE_BOOTUP:
                /* CAN Initialization state */
                /* Send bootup message*/
                can_send_heartbeat(0);
                state = CAN_STATE_BOOTUP_WAIT;
                break;
            case CAN_STATE_BOOTUP_WAIT:
                if(can_msg_transmitted){
                    state = CAN_STATE_BOOTUP_PREOP;
                }
                /*incoming messages are ignored in this state*/
                break;
            case CAN_STATE_BOOTUP_PREOP:
                /*This is the default state*/
                /*Check whether a heartbeat message needs to be sent*/
                if(IFS1bits.T5IF == 1){
                    can_send_heartbeat(127);
                    IFS1bits.T5IF = 0;
                }
                
                if(can_msg_received && (can_msg_rec.cob_id==0x0)){
                   /*Check whether we received an NMT master message*/
                    if(can_msg_rec.data[1]==0x00 || can_msg_rec.data[1]==CAN_NODE_ID){
                        /*Message addressed to this node or all nodes*/
                        switch(can_msg_rec.data[0]){ /*requested mode*/
                            case 1: /*Operational*/
                                /*Switch to main program*/
                                reset_device();
                                break;
                            case 2: /*Stopped*/
                                /*TODO: add support for this?*/
                                /*Do nothing*/
                                break;
                            case 128: /*Pre-operational*/
                                /*Do nothing*/
                                break;
                            case 129: /*Reset node*/
                                /*Reset bootloader*/
                                asm("goto 0x800");
                                Nop();
                                Nop();
                                Nop();
                                break;
                                break;
                            case 130: /*Reset communication*/
                                /*TODO: do we need to do anything here?*/
                                /*Do nothing*/
                                break;
                            default:
                                /*Do nothing*/
                                break;
                        };
                    }
                } /*Check whether we received an SDO read/write*/
                else if(can_msg_received && (can_msg_rec.cob_id==0x600+CAN_NODE_ID)){ /*There's only a single SDO channel*/
                    sdo_ccs = (can_msg_rec.data[0]>>5)&0b111;
                    sdo_s = (can_msg_rec.data[0])&0b1;
                    sdo_e = (can_msg_rec.data[0]>>1)&0b1;
                    sdo_n = (can_msg_rec.data[0]>>2)&0b11;
                    sdo_OD_idx = (((uint16_t)can_msg_rec.data[2])<<8)|(can_msg_rec.data[1]&0xFF); //note the endianness
                    sdo_OD_sidx = can_msg_rec.data[3];
                    switch(sdo_ccs){
                        case 0:
                            /*SDO download request (i.e. a write in progress)*/
                            if(!can_receiving_prog_data){
                                can_send_SDO_abort(0x1F50,0x01,0x08000000);
                            } else {
                                can_toggle_received = (can_msg_rec.data[0]&0b10000)>>4;
                                if(can_toggle_received == can_toggle){
                                    //OK, correct toggle received
                                    can_toggle ^= 1;
                                } else {
                                    //toggle error
                                    can_receiving_prog_data = 0;
                                    can_send_SDO_abort(0x1F50,0x01,0x05030000);
                                    break;
                                }
                                can_num_segments_ctr++;
                                can_last_segment = can_msg_rec.data[0]&0b1;
                                can_segment_n = (can_msg_rec.data[0]>>1)&0b111;
                                can_segment_num_bytes = 7-can_segment_n;

                                if(can_prog_data_ctr+can_segment_num_bytes<=(PM_ROW_SIZE*3+3)){
                                    /*copy data to buffer*/
                                    for(i=0;i<can_segment_num_bytes;++i){
                                        can_prog_data[can_prog_data_ctr++]=can_msg_rec.data[i+1];
                                    }
                                } else {
                                    /*Too much data received, abort*/
                                    can_receiving_prog_data = 0;
                                    can_send_SDO_abort(0x1F50,0x01,0x06070012);
                                    break;
                                }

                                if(can_last_segment){
                                    /*Check if all data was received*/
                                    if(can_prog_data_ctr==(PM_ROW_SIZE*3+3)){
                                        /*Everything seems OK, program the memory page*/
                                        can_receiving_prog_data = 0;
                                        source_addr.val[0] = can_prog_data[0];
                                        source_addr.val[1] = can_prog_data[1];
                                        source_addr.val[2] = can_prog_data[2];
                                        source_addr.val[3] = 0;
                                        if(source_addr.val32>0){
                                            can_prog_data_ctr--;
                                        }

